% Лабораторная №2 Евдокимова О.С. ЭВМб-22-1.
% ВАРИАНТ 6 и 15.
% КРУТОЕ (НАВОРОЧЕННОЕ) ВЫПОЛНЕНИЕ ЗАДАНИЯ).

% Слить два упоpядоченных списка в один, сохpанив упоpядоченность.
merge_sorted_lists([], L, L). % Если первый список пуст, результат — второй список.
merge_sorted_lists(L, [], L). % Если второй список пуст, результат — первый список.

% Сохраняем упорядоченность.
merge_sorted_lists([H1|T1], [H2|T2], [H1|T]) :- 
    H1 =< H2, % Если голова первого <= головы второго, то берём голову первого.
    merge_sorted_lists(T1, [H2|T2], T).
merge_sorted_lists([H1|T1], [H2|T2], [H2|T]) :-
    H1 > H2, % Если голова первого > головы второго, то берём голову первого.
    merge_sorted_lists([H1|T1], T2, T).

% Найти сумму элементов списка, стоящих на нечетных местах в списке.
sum_odd_positions([], 0). % Если список пустой, то сумма = 0.
sum_odd_positions([H], H). % Если один элемент, то он стоит на нечётной позиции. Берём его.
sum_odd_positions([H, _|T], Sum) :- % H - нечётный. _ - чётный. T - хвост с 3-ей позиции.
    sum_odd_positions(T, Rest), % Рекурсивно вычисляем сумму с 3-й позиции.
    Sum is H + Rest. % Добавляем H к сумме оставшихся нечётных элементов.


% Выбор пользователя.
start :-
    nl,
    write('Введите упорядоченный список: '), nl, % newline (новая строка).
    read(List1), nl, % Читаем введённый список.
    write('Выберите действие:'), nl,
    write('1 - Ввести второй список и выполнить слияние'), nl,
    write('2 — Найти сумму элементов на нечетных позициях в списке'), nl,
    read(Choice),
    choice(Choice, List1). % В зависимости от выбора, вызывается следующую функцию.

% Выбор 1.
choice(1, List1) :-
    nl,
    write('Введите второй упорядоченный список: '), nl,
    read(List2), nl,
    merge_sorted_lists(List1, List2, Merged), % Слить списки в один, сохpанив упоpядоченность.
    write('Результат слияния: '), write(Merged), nl,
    sum_odd_positions(Merged, Sum),
    write('Сумма элементов на нечётных позициях: '), write(Sum), nl.

% Выбор 2.
choice(2, List1) :-
    nl,
    sum_odd_positions(List1, Sum),
    write('Сумма элементов на нечётных позициях: '), write(Sum), nl.

% Неверный выбор.
handle_choice(_, _) :-
    nl,
    write('Неверный выбор. Попробуйте снова.'), nl.